app/controllers/comments_controller.rb

        def index
          event = Event.find_by_id(params[:event_id].to_i)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        def create
          event = Event.find_by_id(params[:event_id].to_i)
          if not event.nil?
              comment = event.comments.create(params[:comment].permit(:content))
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "event_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "La vida és meravellosa després de fer un comentari"], ["event_id", 1], ["user_id", 1], ["created_at", "2018-05-04 20:26:14.428460"], ["updated_at", "2018-05-04 20:26:14.428460"]]

        def update
            #event = Event.find_by_id(params[:event_id])
            comment = Comment.find_by_id((params[:comment_id]))
            if not comment.nil?
                if same_user_as_current(comment.user_id)
                    comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Este post e una mierdaaa"], ["user_id", 2], ["updated_at", "2018-04-27 15:10:08.815013"], ["id", 1]]

        def destroy
            comment = Comment.find_by_id(params[:comment_id])
            if comment.nil?
              sendStatus("Comment not found", :not_found)
            else
                if same_user_as_current(comment.user_id)
                    comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

        def find_comment
            event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]