app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 1]]
---
        def destroy
            @comment = @event.comments.find(params[:id]).destroy