app/controllers/events_controller.rb

        def create
            location = Location.create(location_params)
            if location.save
                event = current_user.events.create(event_params)
                event.location = location
                if event.save
---
INSERT INTO "locations" ("created_at", "updated_at", "latitude", "longitude", "address", "name") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-05-03 21:34:02.258250"], ["updated_at", "2018-05-03 21:34:02.258250"], ["latitude", 1.2], ["longitude", 1.3], ["address", "carrer creat"], ["name", "Festa x"]]
UPDATE "locations" SET "updated_at" = ?, "event_id" = ? WHERE "locations"."id" = ?  [["updated_at", "2018-05-03 21:34:02.346470"], ["event_id", 2], ["id", 7]]
INSERT INTO "events" ("title", "description", "created_at", "updated_at", "user_id", "date") VALUES (?, ?, ?, ?, ?, ?)  [["title", "titol creat"], ["description", "descripció creada"], ["created_at", "2018-05-03 21:34:02.309685"], ["updated_at", "2018-05-03 21:34:02.309685"], ["user_id", 1], ["date", "22/06/2020"]]
UPDATE "events" SET "updated_at" = ?, "location_id" = ? WHERE "events"."id" = ?  [["updated_at", "2018-05-03 21:39:32.960664"], ["location_id", 10], ["id", 5]]

        def show
            event = Event.find_by_id(params[:event_id].to_i)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

        def update
            event = Event.find_by_id(params[:event_id])
            if not event.nil?
                if same_user_as_current(event.user_id)
                    if event.nil?
                        sendStatus("Event does not exist", :not_found)
                    else
                        l = Location.find_by_id(event.location_id).update(location_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."event_id" = ? LIMIT ?  [["event_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "user_id" = ?, "title" = ?, "description" = ?, "date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["user_id", 2], ["title", "titol canviat"], ["description", "descripció canviada"], ["date", "22/06/2020"], ["updated_at", "2018-05-04 10:47:45.478662"], ["id", 1]]

        def destroy
            event = Event.find_by_id(params[:event_id].to_i)
            if not event.nil?
                if same_user_as_current(event.user_id)
                    event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 8]]