app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
        def find_event
            @event = Event.find(params[:id])