app/controllers/locations_controller.rb

    def index
        if params[:type] == 'Faculty'
            uni = University.find_by_id(params[:university_id])
            if uni.nil?
                sendStatus("University doesn't exist", :not_found)
            else
                render json: Location.where(:type => params[:type], :university_id => uni.id)
---
SELECT "locations".* FROM "locations" WHERE "locations"."type" = ?  [["type", "University"]]