app/controllers/profiles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        user = User.find_by_id(params[:user_id])

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
    def set_avatar
        if not same_user_as_current(params[:user_id].to_i)
            sendStatus("You don't have permission to modify that user profile", :unauthorized);
        else
            img = params[:profile][:avatar]
            f = File.open(img.path())
            uploader = ImageUploader.new(:store)
            shrine_file = uploader.upload(f)
            f.close()
            p = User.find_by_id(current_user.id).profile