app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "email", "password_digest", "code", "username", "last_status") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def register
        if params.has_key?(:email) and params.has_key?(:username) and params.has_key?(:password)
            if checkRegisterFields?(params[:email], params[:username], params[:password])
                encrypted_pwd = BCrypt::Password.create(params[:password])
                code = SecureRandom.hex[0..7]
                newuser = User.new(:email => params[:email].downcase, :username => params[:username], :password_digest => encrypted_pwd, :code => code, :last_status => Time.now.to_i)
                if newuser.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "qidris9539v@rampas.ml"], ["LIMIT", 1]]
UPDATE "users" SET "activated" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["activated", "t"], ["updated_at", "2018-05-03 19:49:34.170240"], ["id", 1]]
---
    def activate
        if params.has_key?(:email) and params.has_key?(:code)
            user = User.find_by_email(params[:email].downcase)
            if not user.nil?
                if user.code == params[:code]
                    if user.activated
                        sendStatus("User is already activated", :conflict)
                    else
                        user.activated = true
                        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "account_deleted" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["account_deleted", "t"], ["updated_at", "2018-05-05 15:21:23.276312"], ["id", 1]]
---
    def delete
        user = User.find_by_id(params[:user_id])
        if user.nil?
            sendStatus("User does not exist", :not_found)
        else
            if not same_user_as_current(params[:user_id].to_i)
                sendStatus("You don't have permission to delete that user", :unauthorized)
            else
                if user.account_deleted
                    sendStatus("The user is already deleted", :conflict)
                else
                    if user.update(:account_deleted => true)