app/controllers/votes_controller.rb

  def index
    event = Event.find_by_id(params[:event_id].to_i)
    if not event.nil?
      votes = event.votes.count
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."event_id" = ?  [["event_id", 1]]

  def create
    vote = Vote.new
    event = Event.find_by_id(params[:event_id].to_i)
    if not event.nil?
      if Vote.find_by(user_id: current_user.id, event_id: params[:event_id].to_i).nil?
        vote.user_id = current_user.id
        vote.event_id = (params[:event_id]).to_i
        if vote.save
          if not current_user.profile.nil?
            current_user.profile.add_karma(5)
          end
          uid = Event.find_by_id(params[:event_id].to_i).user_id
---
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."event_id" = ? LIMIT ?  [["user_id", 1], ["event_id", 2], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 1], ["created_at", "2018-05-04 22:07:16.158476"], ["updated_at", "2018-05-04 22:07:16.158476"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    event = Event.find_by_id(params[:event_id].to_i)
    if not event.nil?
      vote = Vote.find_by(user_id: current_user.id, event_id: params[:event_id].to_i)
      if not vote.nil?
        if same_user_as_current(vote.user_id)
          vote.destroy
          if not current_user.profile.nil?
            current_user.profile.add_karma(-5)
          end
          uid = Event.find_by_id(params[:event_id].to_i).user_id
---
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."vote_id" = ? LIMIT ?  [["user_id", 1], ["vote_id", 0], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]