app/controllers/votes_controller.rb

SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @votes = Vote.new(vote_params)
    @votes.user = current_user
    @votes.event = Event.find(params[:event_id])

SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_vote
      @vote = Vote.find(params[:id])